# 变量, 变量名不能以数字开头！！
x = 1
y = 2
x, y = y, x # 交换变量, 变为 2, 1
print(x, y)


# 字符串
# 转译字符
# 换行： \n
# 单引号： \'
# 双引号： \"
print('吃沙拉') # 单引号
print('"Python \n Study"') # 单引号
print("Let's Go!") # 双引号
print('''吃饺子''') # 三引号
print("""吃饺子""") # 三引号



# 🔥如何打印系统路径？
# 方法一, 反斜杠:
print("D:\\download\\photoshop\\photoshop.exe")

# 方法二, 前面加 r (原始字符串，可以屏蔽转译字符)
print(r"D:\download\photoshop\photoshop.exe")

# / 表示还在继续打印
# 打印长内容的话， 用三引号
print("""
				   _ooOoo_
                  o8888888o
                  88" . "88
                  (| -_- |)
                  O\  =  /O
               ____/`---'\____
             .'  \\|     |//  `.
            /  \\|||  :  |||//  \
           /  _||||| -:- |||||-  \
           |   | \\\  -  /// |   |
           | \_|  ''\---/''  |   |
           \  .-\__  `-`  ___/-. /
         ___`. .'  /--.--\  `. . __
      ."" '<  `.___\_<|>_/___.'  >'"".
     | | :  `- \`.;`\ _ /`;.`/ - ` : | |
     \  \ `-.   \_ __\ /__ _/   .-` /  /
======`-.____`-.___\_____/___.-`____.-'======
                   `=---='
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

""")



# 🔥基础运算
print(520 + 520) #1040
print('520' + '520') # 520520, 字符串拼接, 跟 js 一样！
print("说 10 遍 \n" * 10)