# 🔥字典, 能够实现两组数据的映射关系

# 建立字典(方法一)
x = {
		"lb":'吕布', 
		"dc":'貂蝉', 
		"gy":'关羽',
	}


# 建立字典（方法二）
b = dict(hmbb = '海绵宝宝', pdx = '派大星')


# 建立字典 (方法三)
c = dict([('xq', '小乔'), ('dz', '董卓')])

# 建立字典 (方法四)
d = dict({
		"zgl":'诸葛亮', 
		"zl":'张辽', 
	})

# 建立字典 (方法五)
e = dict(zip(['swk', 'ss'], ['孙悟空', '沙僧']))


# 建立嵌套字典
f = {
		'吕布': {
			'武器': '方天画戟',
			'技能': '无双',
		},
		'貂蝉': {
			'武器': '倚天剑',
			'技能': '倚天',
		},
		'关羽': {
			'武器': '青龙偃月刀',
			'技能': '青龙',
		},
}

print(f['吕布']['武器'])







# ➕ 查询字典(方法一)
print(x['dc'])


# ➕ 查询字典(方法二)
result = x.get('gy', '找不到值') # 没有这个键的话，返回默认值，不会报错
print(result)


# 获取字典的键值对的长度
print(len(b))

# 判断某个键是否在字典中
print('lb' in x)
print('lb' not in x)






# ✏️ 修改字典 (方法一)
x['zf'] = '张飞'


# ✏️ 修改字典 (方法二)
x.update({'mc': '马超' , 'zy': '赵云'})


# ✏️ 修改字典 (方法三) 如果键存在则修改，不存在则添加
x.setdefault('gdz', '关东煮')






# ➖ 删除字典(方法一)
x.pop('gy')
result2 = x.pop('dog', '没有这个键') # 没有这个键的话，返回默认值，不会报错
print(result2)


# ➖ 删除字典(方法二)
del e['ss']





# 🔥字典推导式
result3 = {'语文':80, '数学':90, '英语':100} 
result3 = {vhh:k for k, vhh in result3.items() }# 键值对调转
print(result3)